Revit 2024 API
AdvancedWood.WoodGrooveRoughness Property
 The property labeled "Roughness for surface groove area" from the "AdvancedWood" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string WoodGrooveRoughness { get; }
Visual Basic
Public Shared ReadOnly Property WoodGrooveRoughness As String
	Get
Visual C++
public:
static property String^ WoodGrooveRoughness {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyDouble".
See Also
AdvancedWood Class
Autodesk.Revit.DB.Visual Namespace